# Pandas

In [1]:
import pandas as pd

In [7]:
datos = {
        'ID'        : [0, 1, 2],
        'Nombre'    : ['Juan', 'Luis', 'José'],
        'Edad'      : [20, 40, 30],
        'Salario'   : [20000, 50000, 35000],
        'Puesto'    : ['Programador', 'Gerente', 'Supervisor']
    }
datos['Nombre']

['Juan', 'Luis', 'José']

In [10]:
df = pd.DataFrame(
    datos
)
df = df.set_index('ID')
df

   Nombre  Edad  Salario       Puesto
ID
0    Juan    20    20000  Programador
1    Luis    40    50000      Gerente
2    José    30    35000   Supervisor

In [9]:
df['Edad']

ID
0    20
1    40
2    30
Name: Edad, dtype: int64

In [11]:
df.to_csv('ejemplo.csv')

In [13]:
df1 = pd.read_csv('./ejemplo.csv')
df1 = df1.set_index('ID')
df1

   Nombre  Edad  Salario       Puesto
ID
0    Juan    20    20000  Programador
1    Luis    40    50000      Gerente
2    José    30    35000   Supervisor

In [15]:
df.head(2)

   Nombre  Edad  Salario       Puesto
ID
0    Juan    20    20000  Programador
1    Luis    40    50000      Gerente

In [17]:
df.tail()

   Nombre  Edad  Salario       Puesto
ID
0    Juan    20    20000  Programador
1    Luis    40    50000      Gerente
2    José    30    35000   Supervisor

In [19]:
df.index
df.columns

Index(['Nombre', 'Edad', 'Salario', 'Puesto'], dtype='object')

In [21]:
df['Edad'].max()

np.int64(40)

In [22]:
df['Salario'].mean()

np.float64(35000.0)

In [23]:
df.describe()

       Edad  Salario
count   3.0      3.0
mean   30.0  35000.0
std    10.0  15000.0
min    20.0  20000.0
25%    25.0  27500.0
50%    30.0  35000.0
75%    35.0  42500.0
max    40.0  50000.0

In [24]:
datos = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Marta', 'Elena', 'Jorge', 'Lucía', 'Pedro', 'Sofía', 'Andrés',
                'Valeria', 'Tomás', 'Daniela', 'Raúl', 'Natalia'],
    'Edad': [23, 35, 45, 29, 31, 38, 26, 42, 34, 28, 30, 40, 27, 37, 33],
    'Ciudad': ['Madrid', 'Sevilla', 'Barcelona', 'Valencia', 'Bilbao', 'Zaragoza', 'Granada', 'Madrid',
                'Sevilla', 'Málaga', 'Toledo', 'Vigo', 'Murcia', 'Salamanca', 'León'],
    'Profesión': ['Ingeniera', 'Doctor', 'Profesor', 'Abogada', 'Contadora', 'Arquitecto', 'Diseñadora', 'Técnico',
                    'Psicóloga', 'Enfermero', 'Periodista', 'Chef', 'Veterinaria', 'Administrador', 'Analista'],
    'Salario': [2400, 3000, 2800, 2600, 2500, 3200, 2300, 2700, 2600, 2550, 2400, 2750, 2450, 2900, 2650]
}
df = pd.DataFrame(datos, index=range(1, 16))
df

     Nombre  Edad     Ciudad      Profesión  Salario
1       Ana    23     Madrid      Ingeniera     2400
2      Luis    35    Sevilla         Doctor     3000
3    Carlos    45  Barcelona       Profesor     2800
4     Marta    29   Valencia        Abogada     2600
5     Elena    31     Bilbao      Contadora     2500
6     Jorge    38   Zaragoza     Arquitecto     3200
7     Lucía    26    Granada     Diseñadora     2300
8     Pedro    42     Madrid        Técnico     2700
9     Sofía    34    Sevilla      Psicóloga     2600
10   Andrés    28     Málaga      Enfermero     2550
11  Valeria    30     Toledo     Periodista     2400
12    Tomás    40       Vigo           Chef     2750
13  Daniela    27     Murcia    Veterinaria     2450
14     Raúl    37  Salamanca  Administrador     2900
15  Natalia    33       León       Analista     2650

In [25]:
df.loc[3:5, ['Nombre', 'Edad']]

   Nombre  Edad
3  Carlos    45
4   Marta    29
5   Elena    31

In [26]:
df.iloc[2:5, 0:2]

   Nombre  Edad
3  Carlos    45
4   Marta    29
5   Elena    31

In [30]:
df[df['Salario'] <= 2500]

     Nombre  Edad   Ciudad    Profesión  Salario
1       Ana    23   Madrid    Ingeniera     2500
5     Elena    31   Bilbao    Contadora     2500
7     Lucía    26  Granada   Diseñadora     2500
11  Valeria    30   Toledo   Periodista     2500
13  Daniela    27   Murcia  Veterinaria     2500

In [28]:
df.loc[(df['Salario'] < 2500), 'Salario'] = 2500

In [33]:
import numpy as np

In [51]:
datos = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Marta', 'Pedro'],
    'Edad': [25, None, 35, 40, np.nan],
    'Salario': [3000, 4500, np.nan, 5000, 4200],
    'Ciudad': ['Tegucigalpa', 'San Pedro Sula', 'La Ceiba', np.nan, 'Choluteca']
}

df = pd.DataFrame(datos)

In [41]:
df

   Nombre  Edad  Salario          Ciudad
0     Ana  25.0   3000.0     Tegucigalpa
1    Luis   NaN   4500.0  San Pedro Sula
2  Carlos  35.0      NaN        La Ceiba
3   Marta  40.0   5000.0             NaN
4   Pedro   NaN   4200.0       Choluteca

In [ ]:
df.dropna(how='any')

  Nombre  Edad  Salario       Ciudad
0    Ana  25.0   3000.0  Tegucigalpa

In [48]:
df['Ciudad'] = df['Ciudad'].fillna(value='NoValida')

In [49]:
df

   Nombre  Edad  Salario          Ciudad
0     Ana  25.0   3000.0     Tegucigalpa
1    Luis   NaN   4500.0  San Pedro Sula
2  Carlos  35.0      NaN        La Ceiba
3   Marta  40.0   5000.0        NoValida
4   Pedro   NaN   4200.0       Choluteca

In [50]:
df.fillna(value=0)

   Nombre  Edad  Salario          Ciudad
0     Ana  25.0   3000.0     Tegucigalpa
1    Luis   0.0   4500.0  San Pedro Sula
2  Carlos  35.0      0.0        La Ceiba
3   Marta  40.0   5000.0        NoValida
4   Pedro   0.0   4200.0       Choluteca

In [52]:
df.isna()

   Nombre   Edad  Salario  Ciudad
0   False  False    False   False
1   False   True    False   False
2   False  False     True   False
3   False  False    False    True
4   False   True    False   False

In [53]:
datos = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'María', 'Pedro'],
    'Edad': [23, 35, 45, 29, 31],
    'Salario': [2500, 3200, 4000, 2800, 3500]
}

df = pd.DataFrame(datos)

In [54]:
df[['Edad', 'Salario']].agg(lambda x: np.std(x))

Edad         7.310267
Salario    525.357021
dtype: float64

In [55]:
df

   Nombre  Edad  Salario
0     Ana    23     2500
1    Luis    35     3200
2  Carlos    45     4000
3   María    29     2800
4   Pedro    31     3500

In [63]:
df['Edad'] = df['Edad'].transform(lambda x: x + 1)
df

   Nombre  Edad  Salario
0     Ana    31     2500
1    Luis    43     3200
2  Carlos    53     4000
3   María    37     2800
4   Pedro    39     3500